app/controllers/notes_controller.rb

SELECT * FROM "notes" WHERE ("notes"."id" = 2053932785)
---
  def show
    @note = Note.find(params[:id])